[
  {
    "id": "1",
    "title": "ASP Web Developer",
    "company": "AG Net Pte Ltd",
    "salary": "2,700",
    "location": "Ubi",
    "saved": true,
    "applied": false,
    "date": "2020-09-05T13:44:26+0000",
    "description": "We are looking for a Web Developer to build and implement functional programs. You will work with other Developers and Product Managers throughout the software development life cycle. In this role, you should be a team player with a keen eye for detail and problem-solving skills. If you also have experience in .Net frameworks and popular coding languages (e.g. JavaScript), we’d like to meet you. Your goal will be to build efficient programs and systems that serve user needs. Responsibilities a. Work with developers to design algorithms and flowcharts b. Produce clean, efficient code based on specifications c. Integrate software components and third-party programs d. Verify and deploy programs and systems e. Troubleshoot, debug and upgrade existing software f. Gather and evaluate user feedback g. Recommend and execute improvements h. Create technical documentation for reference and reporting Requirements a.At least 1 year experience with software devcelopment b.Experience with MS SQL Server c. Ability to learn new languages and technologies d. Excellent communication skills e. Resourcefulness and troubleshooting aptitude f. Attention to detail g. Degree or Diploma in Computer Science, Engineering or a related field Job Type: Full-time Salary: $2,700.00 - $3,500.00 per month Experience: .NET: 1 year (Preferred) Work eligibility status: Eligible to work in Singapore and do not need work sponsorship (Preferred)"
  },
  {
    "id": "2",
    "title": "Web Developer #Sg Traineeship",
    "company": "First Sight International Pte Ltd",
    "salary": "1500",
    "location": "Toa Payoh",
    "saved": false,
    "applied": false,
    "date": "2020-09-02T13:44:26+0000",
    "description": "1. Writing well designed, testable, efficient code by using best software development practices 2. Creating website layout/user interfaces by using standard HTML/CSS practices 3. Integrating data from various back-end services and databases 4. Write well designed, testable, efficient code by using best software development practices 5. Create website layout/user interface by using standard HTML/CSS practices 6. Integrate data from various back-end services and databases 7. Gather and refine specifications and requirements based on technical needs 8. Create and maintain software documentation 9. Be responsible for maintaining, expanding, and scaling our site 10. Stay plugged into emerging technologies/industry trends and apply them into operations and activities 11. Cooperate with web designers to match visual design intent Job Types: Full-time, Volunteer, Permanent Salary: $1,500.00 - $1,800.00 per month"
  },
  {
    "id": "3",
    "title": "Web Designer & Developer",
    "company": "Kingmaker Entertainment",
    "salary": "3000",
    "location": "Singapore",
    "saved": false,
    "applied": false,
    "date": "2020-09-01T13:44:26+0000",
    "description": "***Singaporeans only*** Kingmaker Studio is an indie game studio specialises in mobile game development on Unity and Html5. In less than a year, we have grown from 11 members to over 50 and shipped more than 2 dozen games growing our daily active player base by the thousands every month. With such a trajectory, we have every intention to keep the momentum going for the good work done by the talented and enthusiastic game lovers in the studio. We have Kingmakers in Singapore (HQ), Malaysia, Vietnam and Taiwan (latest addition). We have battle-tested entrepreneurs and leaders leading each functional departments from developing games to marketing and operationalising them. We look forward to bolstering our engineering capabilities with this listing. We are looking for a creative individual who enjoys building intuitive and visually stunning websites, somebody who understands the importance of a well-designed website, promoting engagement, selling an idea or informing the visitors. He/She will be working with the Product managers in designing highly tailored websites to show our players what fun we have installed for them, manage our public-facing websites to keep it fresh and exciting, develop overall brand recognition for Kingmaker as being the first point of contact in our modern lifestyle. He/she will also be supported by a team of artists and designer in putting together beautiful assets from our games to be populated onto the site. As we are expanding our product lines, a dedicated website will be developed to support the overall game aesthetic and fitting for the target audience. Please contact us for more information about the position. ***Singaporeans only*** Role and Responsibilities: Work with Product managers and artists to craft or understand the messaging and aesthetic for each product website that is to be developed creating website designs producing sample sites developing skills and expertise in appropriate software/programming languages such as HTML and Javascript creating products that are user-friendly, effective and appealing digital retouching and image editing working as part of a multidisciplinary team Requirements: A relevant diploma in related field. Proficiency in graphic design software including Adobe Photoshop, Adobe Illustrator, and other visual design tools. Proficiency in front-end development web programming languages such as HTML and CSS, JQuery, and JavaScript. Good understanding of content management systems. Good understanding of search engine optimization principles. Proficient understanding of cross-browser compatibility issues. Excellent visual design skills. Up-to-date experience with international web protocols, standards, and technologies. Creative and open to new ideas. Adaptable and willing to learn new techniques. Excellent communication skills. ***Singaporeans only*** Job Types: Full-time, Permanent Salary: $3,000.00 - $4,500.00 per month Experience: web development: 2 years (Preferred) web design: 2 years (Preferred) Work eligibility status: Eligible to work in Singapore and do not need work sponsorship (Required)"
  },
  {
    "id": "4",
    "title": "PHP Web Developer - Fleetnetics",
    "company": "DewTouch Innovations Pte Ltd",
    "salary": "3000",
    "location": "Singapore",
    "saved": false,
    "applied": false,
    "date": "2020-08-26T13:44:26+0000",
    "description": "Fleetnetics empowers the rental, workshops and spare parts companies with the best in class automotive management platform, productivity services & connects them to their clients via our ecosystem. If you are smart, hungry and not shy of hard work, you might get the chance to play a key role in web development for one of Singapore’s leading fleet management system. (http://www.fleetnetics.com) Our customers rely on us to deliver the inteligence, technology and human expertise they need to find trusted answers. Join our exciting, fast-growing international company, offering a friendly, informal and creative environment with many opportunities for personal and professional growth. Get to know the Role: Become the ultimate PHP web developer to our Product Development team with a passion and talent for getting our flagship product Fleetnetics implemented. Attend Meeting with Technical Team Colleagues Code & Debug Correctly Thank out of the box and contribute creatively to the project management proccess. Provide guidance to our customers in using our application. Maintain good relationship with our users. Provide assistance to the team whenever necessary. The day-to-day: Monitor various company communication channels including office calls, technical emails and respond appropriately in a timely manner. Gather new requirements & feedback from end users, react accordingly and report promptly to supervisior. Perform ad-hoc tasks as required by the team to improve overall business such as system demo and training. Perform administrative tasks involving creating technical and other documentations Reponsible to answer inquiry and resolve issues raised by customers. CODE & CODE The must haves: COMMON SENSE 2 years of experience with PHP - must 2 years of experience with JavaScript, Html, CSS, jQuery, Ajax – must. Thorough understanding of MVC development methodologies – must Thorough understanding of OOP – must. Hands on experience with GITHUB – must. Experience with CAKEPHP – considerable advantage. Experience with Databases, SQL, Bootstrap – advantage We also welcome programmers working remotely from overseas. Job Types: Full-time, Part-time, Contract, Permanent"
  },
  {
    "id": "5",
    "title": "Web Developer",
    "company": "Techfount Systems Pte Ltd",
    "salary": "4000",
    "location": "Singapore",
    "saved": false,
    "applied": false,
    "date": "2020-08-24T13:44:26+0000",
    "description": "JOB SPECIFICATIONS The successful candidate for the role of Web Developer will be required: To perform maintenance of existing modules / development of new modules To perform post-rollout maintenance work such solving of problem reports or development of change requests Proposed or to develop and test applications based on given designs To perform testing for applications to write test scripts for modules developed Tests To perform other ad-hoc activities as Authority. To explore new technologies and assess them. SKILL-SETS AND WORK EXPERIENCE The skill sets and work experience for a Web Developer are as follows: Minimum 3 years of experience in DOT NET Core and Framework programming such as VB.NET, C#.NET Experience in developing Content Management System using DOT NET Experience in writing SQL, Experience with database management systems such as MS SQL, MYSQL Basic web design knowledge, HTML/XHTML, CSS, JavaScript, jQuery and Bootstrap Experience with server-side frameworks such as PHP, ASP.NET Knowledge of web services or API. Experience in managing APIs resources which work across devices Experience in developing customized application like sales system, purchase system and other CRM systems. Experience in using IIS web server and Web/Mobile Application (Andriod and Apple) implementation will be advantage Sound knowledge in digital marketing and SEO will be advantage Sound knowledge on Photoshop and other editing software will be advantage Job Type: Full-time Experience: Web Development: 2 years (Preferred) Work Remotely: Temporarily due to COVID-19"
  },
  {
    "id": "6",
    "title": "Software Engineer (Web/Mobile)",
    "company": "PALO IT",
    "salary": "4000",
    "location": "Raffles",
    "saved": false,
    "applied": false,
    "date": "2020-08-25T13:44:26+0000",
    "description": "Job Description - Software Engineer (Web/Mobile) About us PALO IT is an innovation & agile development company. From Design Research to DevOps, we are in the business of end-to-end development of breakthrough digital experiences. As a community of innovators and developers, we also aim at renewing the way organizations operate, promoting sustainable business agility, user-centricity and open collaboration while having fun doing it. Started in France in 2009 and with offices in Singapore, Australia, Hong Kong, Thailand and Mexico, we are looking for our next superstar to join our exciting team in Singapore. At PALO IT, our employees are not widgets. They are in the center of all our projects and successes. We offer an exciting and creative working environment, with endless opportunities to develop your skills, travel and take your career to the next level. Get in touch to find out more! Our Vision and Values We aspire to positively impact the world by empowering organisations to harness the power of transformative technology for the greater good. We care about our World We act with Courage We Share, it’s in our DNA We choose Positivity We Deliver Awesomeness Your profile & responsibilities YOU: Thrive on challenge. When was the last time you failed? Are curious & always learning. What are you up to right now? Can deal with constant change. When were you last surprised? Have mastered at least one skill of your trade but you’re not defined by it. What can you teach us? Can you wear many hats? YOUR RESPONSIBILITIES: Having graduated from an Engineering School, you have demonstrated experience in the role of Mobile/ Web Software Engineer. You are passionate about new technologies and digital innovation. You have already worked in an Agile environment, understand Scrum methodologies and can communicate well. You are an independent thinker with strong opinions, loosely held. Most importantly, you are someone who loves CODE! Within projects, you will initiate development, carry out scoping estimations, implement architecture designs and write architecture documents. You will assist our customers in adopting best practice in new architecture patterns. You will carry out code, performance and security reviews and make proposals for improvement appropriate to the client's business context. Some important attributes: Writing reusable, testable, and efficient code. Ensuring high performance, low latency application design. Familiarity with Agile / Scrum Methodologies and will be part of daily stand ups, backlog management, demos, retros, etc. Proven experience providing end to end development that includes testing, maintenance, and support. YOUR PROFILE FOR WEB ENGINEER: You have at least 5 years of hands-on experience in front-end development (Javascript/AngularJS/ReactJS/VueJS etc) and back-end development (NodeJS/Java/GoLang/.NET/Python/Spring/SpringBoot etc) Experience in hybrid and native mobile development (Swift/Java/Kotlin/React Native etc) is a bonus. You have strong experience with dB design and application - both relational and NoSQL You have strong experience in API development, using REST, GraphQL or SOAP. You have deep experience with the developer tool chain, in particular npm, SCSS/SASS, Webpack, Web Assembly, Bash, Ant and the Command line. You are interested in designing scalable, reliable and secure software using a combination of different languages, frameworks, libraries and technical environments. You like to work in all phases of a rapid product development lifecycle. You have good experience in Agile practices and Scrum in particular with exposure to Design Thinking, Lean Start-up, TDD, BDD, or XP. You are an articulate communicator and inherent collaborator. You are endlessly curious and thrive in an environment where you are continually challenged. YOUR PROFILE FOR MOBILE ENGINEER: Min. 2 years of experience mobile app development with iOS or Android Portfolio of apps in the store Advanced Swift/Obj-C/Java/Kotlin/React Native skills Experience with API interaction, micro-services connectivity Experience in resolving challenges with local storage, hybrid approaches to development and memory management techniques Strong UX/UI implementation capabilities and experience in realising creative visions in code Excellent interpersonal and cross-group collaboration skills Excellent oral/written communication in English Independent thinker with strong work ethic but also willing and able to conform to established architectural constraints Detail oriented with good organisational skills Ability to work on multiple priorities and/or projects simultaneously Good troubleshooting skills and ability to meet deadlines Strong team player, ability to build positive and collaborative relationships Ability to work under general supervision Your role as PALO IT Ambassador You will be part of a project team working at various client sites, building or enhancing complex applications in the digital domain and serving as a touchstone for clients around agile development, best practices and emerging technologies. You will use your skills and experience to teach others and take advantage of opportunities to learn and improve your own skill sets. You will also be invited to take part in R&D works done within our Practices. You will have the chance to assist or be a speaker at must-attend international IT conferences. You will have the opportunity to write articles for our Blog or specialized press. Genuine ambassador of PALO IT, you will present our offers and take an active role in the development of the company. In addition, you will contribute to the social, environmental and purpose driven objectives and initiatives of PALO IT in order to positively impact our environment, customers, communities and ourselves as an organization and individual. If you like what you just read, we’d love to have a chat with you! We might not be able to get back to every applicant but we promise your application will be reviewed by one of our recruitment experts. Job Types: Full-time, Permanent Salary: From $4,000.00 per month Work eligibility status: Currently on an active Singapore employment pass (EP, PEP, SP) (Required) Work Remotely: Temporarily due to COVID-19"
  },
  {
    "id": "7",
    "title": "Full Stack Web Developer",
    "company": "Aniworks Pte. Ltd.",
    "salary": "4000",
    "location": "Singapore",
    "saved": false,
    "applied": false,
    "date": "2020-08-23T13:44:26+0000",
    "description": "aWHY ANIWORKS? Work with the most passionate, team-oriented, visionary, and crazy-smart people you’ll ever meet in your life. Music talent development is our passion. We are starting up to work with talented musicians around the world. How cool is that? Aniworks is not just an artist management company. We support our artists with technology from end to end. We create, edit, publish, practice, nurture and develop our artists. We are building a legion of musical creation talents. The impact you can have here is strong. The things we build would scale across multiple countries and regions. Join us for an endless learning experience. As a software engineer on our core team, you will help build scalable web frontends, multimedia workflow automation, audience engagement applications, used by our large artist fanbase. We are looking for full stack engineers that are capable of building a feature from conception to release and are comfortable working on all parts of our technology stack. You Have: 2-5 years of work experience Full Stack engineer interested in both front and back end development Experience with web frontend stacks e.g. Angular, React Experience with web backend stacks e.g. nodejs, php, nginx/apache Experience with compiled languages such as C#, Java or golang Familiar with APIs, databases Focused on writing clear, readable, testable, and monitored code Collaborative team member, self starter, and adaptable Product-minded with an interest in understanding the end user You Might Have: Experience developing on Android and iOS platforms, native or PWA Familiarization with racking servers in a datacenter You'll Love: Working from home! High-end company-provided equipment Working with famous YouTube artists Working on unique projects that are used by our artist fanbase CPF contribution Flexible vacation policy Opportunities to visit/work out of our studios in other countries Job Types: Full-time, Contract, Permanent Pay: $4,000.00 - $7,000.00 per month Experience: software engineering: 2 years (Required) Education: Bachelor's or equivalent (Preferred) Work Remotely: Temporarily due to COVID-19"
  },
  {
    "id": "8",
    "title": "Frontend Web Developer Intern",
    "company": "Gigworks Pte Ltd",
    "salary": "1500",
    "location": "Tanjong Pagar",
    "saved": false,
    "applied": false,
    "date": "2020-08-22T13:44:26+0000",
    "description": "Responsibilities Develop and implement UI/UX design wireframes to actual code that will produce visual elements of the application Work with the UI/UX designer and bridge the gap between graphical design and technical implementation Build reusable code and libraries for future use Ensure the technical feasibility of UI/UX designs Develop responsive UI/UX using Javascript/Jquery and Bootstrap Assure that all user input is validated before submitting to back-end Work with backend and mobile developers for continuous development and deployment Take ownership and drive effective closure to complex or escalated technical issues Keep track of outstanding tickets and update client proactively on resolution status Document troubleshooting methodology and resolution steps Ensure codes are in compliance to standards Participate in system testing and manage UAT Requirements Diploma / Degree in Information Technology / Computer Science / Graphic Design / Animation or equivalent Familiar with web technologies such as JavaScript, HTML5 and CSS and responsive web design techniques Familiar with frameworks such as jQuery, Bootstrap and AngularJS Strong UI/UX design exposure and experience in making apps work intuitively Able to work independently as well as in a team Able to multi-task in a demanding, fast paced environment and work with minimal supervision to meet deadlines Able to prioritize, meet deadlines and manage multiple tasks School graded internship from local institutions will be given priority Students in their final year of studies with possible conversion to permanent staff after internship are preferred Application Instructions Interested candidates may send detailed resume, last drawn and expected salary by clicking on Apply Now. Only shortlisted candidates will be notified."
  },
  {
    "id": "9",
    "title": "Web Developer Intern",
    "company": "Navtech Pte Ltd",
    "salary": "1200",
    "location": "Outram",
    "saved": false,
    "applied": false,
    "date": "2020-08-17T13:44:26+0000",
    "description": "Responsibilities: · IBM cloud management. · Web development, test and deployment. Details: · Build secure, fast and scalable web applications & web page for businesses owned by the company. · The development includes front-end (user-facing) as well as back-end (server-side on IBM cloud). Requirements: · Basic to intermediate knowledge of IBM cloud, HTML5, CSS, PHP, JavaScript, WordPress, MySQL, relational database, Google Analytics, etc. · Cloud service management (Experience on IBM cloud is a prefered. Experience on IBM CP4D is a plus). · Experience in web design & web development. · Experience in using and managing cloud services. · Experience in designing and building web apps · Related course of study / educational background is preferred. · Creative and self-driven individual with a thirst for real-world experience · Able to work independently and with attention to detail · Knowledge in developing and integrating services using IBM cloud-based APIs. · Knowledge of relevant tools is a plus. · Knowledge in developing mobile Apps (Android/iOS) is a plus. · You are encouraged to provide samples/list/links of websites and apps you have developed. Job Types: Full-time, Internship Salary: $700.00 - $1,200.00 per month Experience: web development and cloud services: 1 year (Preferred) Work Remotely: No"
  },
  {
    "id": "10",
    "title": "Frontend Web Developer Intern",
    "company": "Gigworks Pte Ltd",
    "salary": "800",
    "location": "Tanjong Pagar",
    "saved": false,
    "applied": false,
    "date": "2020-08-13T13:44:26+0000",
    "description": "Responsibilities Develop and implement UI/UX design wireframes to actual code that will produce visual elements of the application Work with the UI/UX designer and bridge the gap between graphical design and technical implementation Build reusable code and libraries for future use Ensure the technical feasibility of UI/UX designs Develop responsive UI/UX using Javascript/Jquery and Bootstrap Assure that all user input is validated before submitting to back-end Work with backend and mobile developers for continuous development and deployment Take ownership and drive effective closure to complex or escalated technical issues Keep track of outstanding tickets and update client proactively on resolution status Document troubleshooting methodology and resolution steps Ensure codes are in compliance to standards Participate in system testing and manage UAT Requirements Diploma / Degree in Information Technology / Computer Science / Graphic Design / Animation or equivalent Familiar with web technologies such as JavaScript, HTML5 and CSS and responsive web design techniques Familiar with frameworks such as jQuery, Bootstrap and AngularJS Strong UI/UX design exposure and experience in making apps work intuitively Able to work independently as well as in a team Able to multi-task in a demanding, fast paced environment and work with minimal supervision to meet deadlines Able to prioritize, meet deadlines and manage multiple tasks School graded internship from local institutions will be given priority Students in their final year of studies with possible conversion to permanent staff after internship are preferred Interested candidates may send detailed resume, last drawn and expected salary by clicking on Apply Now. Only shortlisted candidates will be notified. Job Types: Full-time, Internship Salary: $800.00 - $1,200.00 per month"
  }
]
